----
Homework no: 3
===

### Name : Goki Folder Rudianto Purba | Student ID : 1101208510   

---
#### (x) My refrence 
#### (v) I totally write by myself
#### Author |  ***[Goki Purba GitHub](https://github.com/gokipurba "Purba's GitHub")***

#### 1. Import File .txt

In [ ]:
import pandas as pd
#data_frame(df)
df = pd.read_csv("LB_TA.txt", delimiter="\t")
df.head()

   gvkey  datadate   fyear  tic        at
0   1004  20090531  2008.0  AIR  1377.511
1   1004  20100531  2009.0  AIR  1501.042
2   1004  20110531  2010.0  AIR  1703.727
3   1004  20120531  2011.0  AIR  2195.653
4   1004  20130531  2012.0  AIR  2136.900

In [ ]:
df.shape

(13376, 5)

#### 2. Menghapus Tic dengan nilai at = 0

In [ ]:
new_df = df.dropna(subset= ['at'])
new_df

       gvkey  datadate   fyear    tic          at
0       1004  20090531  2008.0    AIR    1377.511
1       1004  20100531  2009.0    AIR    1501.042
2       1004  20110531  2010.0    AIR    1703.727
3       1004  20120531  2011.0    AIR    2195.653
4       1004  20130531  2012.0    AIR    2136.900
...      ...       ...     ...    ...         ...
13371  15743  20111231  2011.0  DBSDY  263242.972
13372  15743  20121231  2012.0  DBSDY  289039.627
13373  15743  20121231  2012.0  DBSDY  289039.627
13374  15743  20131231  2013.0  DBSDY  318497.861
13375  15743  20131231  2013.0  DBSDY  318497.861

[12570 rows x 5 columns]

#### 3. Menggabungkan label "tic" yang sama kemudian dilakukan func method .mean() untuk mencari rata-rata

In [ ]:
tic = new_df.groupby(['tic'])
tic = tic.mean()
tic["at"].tail(100)

tic
WACLY      2527.741333
WBA       28370.666667
WBK      578113.277333
WCM.A        53.693667
WDAY        867.147000
             ...
ZNT        2479.513500
ZQKSQ      1803.654500
ZRBA         21.217500
ZTS        5953.750000
ZZ          959.528000
Name: at, Length: 100, dtype: float64

In [ ]:
tic["at"].loc[["AIR","ADCT","IWKS","AAL","CECE", "ASA", "AVX", "PNW", "AAN", "ABT"]]

tic
AIR      1852.388833
ADCT     1579.700000
IWKS       21.401000
AAL     27556.166667
CECE      132.384667
ASA       493.668333
AVX      2283.083000
PNW     12631.711667
AAN      1572.008667
ABT     54127.155000
Name: at, dtype: float64

#### 4. Save to .csv

In [ ]:
tic["at"].to_csv("LB_TA.csv")